ecrdoc.org
#+OPTIONS: ^:nil
* GA Control Flow
** Full Optimization
  - <<<ecr>>>(fitness.fun, minimize [TRUE if not given or in fitnes.fun], n.objectives, n.dim, lower, upper, n.bits, representation {"binary", "float", "permutation", "custom"}, mu, lambda, perm, p.recomb = 0.7, p.mut = 0.3, survival.strategy = {"plus", "comma"}, n.elite = 0, custom.constants = list(), log.stats = list(fitness = list("min", "mean", "max")), log.pop = FALSE, monitor, initial.solution, parent.selector, survival.selector, mutator, recombinator, terminators = list(stopOnIters(100))) ::
    performs whole optimization. Params:
    - =fitness.fun= may contain =n.objectives=, =minimize=, =n.dim=, =lower=, =upper=
    - =mu=, =lambda=: generation settings
    - =mutator=, =recombinator=, =survival.selector=, =parent.selector=: choose operators
    - Dimension dependent on =representation=:
      - "binary" :: =n.bits=
      - "float" :: =n.dim= [ =lower=, =upper= ]
      - "permutation" :: =perm=
      - "custom" :: =initial.solution=
    - =survival.strategy= selects replaceMuPlusLambda / replaceMuCommaLambda
      - =n.elite= for "comma"
    - =p.recomb=, =p.mut= for generateOffspring
    - =custom.constants= is not used.
    - =log.stats=, =log.pop= for logging; =monitor= probably as well, but not used.
    - =parent.selector=, =survival.selector=, =mutator=, =recombinator=, =terminators=: operators
    Flow:
    - initECRControl()
    - registerECROperator $\circ$ getDefaultEvolutionaryOperators
    - initLogger()
    - initPopulation()
      - [using [[generator operators][generator operators]]]
    - Loop:
      - generateOffspring
	- [calls recombinate (or skips this, but getMatingPool still gets called)]
	  - [calls getMatingPool]
	    - [calls selectForMating]
	      - [calls *$selectForMating* slot [[selection operators][selection operators]]]
	  - [calls *$recombine* slot [[crossover operators][crossover operators]]]
	- [calls mutate]
	  - [calls *$mutate* slot [[mutation operators][mutation operators]]]
      - evaluateFitness
	- [evaluates the task's *$fitness.fun*]
      - replaceMuPlusLambda / replaceMuCommaLambda
	- [calls selectForSurvival]
	  - [calls *$selectForSurvival* slot [[selection operators][selection operators]]]
    - updateLogger
    Returns <<<ecr_result>>> (<<<ecr_multi_objective_result>>> or <<<ecr_single_objective_result>>>)
    - $task
    - $best.x *single objective*
    - $best.y *single objective*
    - pareto.idx: index into last.population of pareto front *multi objective*
    - pareto.front: matrix of objective values for pareto.set
    - pareto.set: just population[pareto.idx]
    - log: logger object
    - last.population
    - last.fitness *single objective*
    - message
  - <<<nsga2>>>(fitness.fun, n.objectives, n.dim, minimize, lower, uppwer, mu = 100, lambda, mutator = mutPolynomial(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = recSBX(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100))) ::
    performs NSGA-II EMOA algorithm: calls ecr() with representation = "float", survival.strategy = "plus", parent.selector = selSimple, survival.selector = selNondom
  - <<<smsemoa>>>(fitness.fun, n.objectives, n.dim, minimize, lower, upper, mu = 100, ref.point [numeric, defaults to rep(11, n.objectives), wtf!], mutator = mutPolynomial(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = recSBX(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100))) ::
    performs SMS-EMOA algorithm: calls ecr() with lambda = 1, representation = "float", survival.strategy = "plus", parent.selector = selSimple, survival.selector = selDomHV(ref.point)
  - <<<asemoa>>>(fitness.fun, n.objectives, minimize, n.dim, lower, upper, mu = 10, aspiration.set, normalize.fun, dist.fun [function(x), default euclidean], p = 1, parent.selector = selSimple, mutator = mutPolynomial(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = recSBX(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100))) :: 
    "Aspiration set evolutionary multi-objective algorithm"
    - =aspiration.set= is a matrix of aspiration points
    - =normalize.fun= a function(set, aspiration.set) ->
    - defines **fastASEMOASelector**: 
    calls ecr() with representation = "float", lambda = 1, initial.solution a set of nondominated uniformly sampled individuals, and survival.selector the "fastASEMOASelector".

