ecrdoc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-16 Wed 16:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="user" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org739dd64">1. GA Control Flow</a>
<ul>
<li><a href="#orgbd5b20b">1.1. Full Optimization</a></li>
<li><a href="#org3e9fba9">1.2. Init functions</a></li>
<li><a href="#org8f9f7c2">1.3. Individual Action</a></li>
</ul>
</li>
<li><a href="#org26da823">2. Operators</a>
<ul>
<li><a href="#org6882ed1">2.1. mutation operators</a></li>
<li><a href="#org30d12c8">2.2. selection operators</a></li>
<li><a href="#org5139d65">2.3. generator operators</a></li>
<li><a href="#org9144638">2.4. crossover operators</a></li>
<li><a href="#org22500bd">2.5. terminator operators</a></li>
<li><a href="#orgbf46f2d">2.6. EMOA</a></li>
</ul>
</li>
<li><a href="#orgdf58156">3. helper functions</a>
<ul>
<li><a href="#org65b2b4e">3.1. Computation</a></li>
<li><a href="#org97c751e">3.2. domination</a></li>
<li><a href="#org111cb4b">3.3. logger</a></li>
<li><a href="#org8927248">3.4. Pareto Archive</a></li>
<li><a href="#orgd2bc62c">3.5. Plotting</a></li>
</ul>
</li>
<li><a href="#orgd048e25">4. Orphaned</a></li>
</ul>
</div>
</div>
<div id="outline-container-org739dd64" class="outline-2">
<h2 id="org739dd64"><span class="section-number-2">1</span> GA Control Flow</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgbd5b20b" class="outline-3">
<h3 id="orgbd5b20b"><span class="section-number-3">1.1</span> Full Optimization</h3>
<div class="outline-text-3" id="text-1-1">
<dl class="org-dl">
<dt><a id="orgbd2c58d">ecr</a>(fitness.fun, minimize [TRUE if not given or in fitnes.fun], n.objectives, n.dim, lower, upper, n.bits, representation {"binary", "float", "permutation", "custom"}, mu, lambda, perm, p.recomb = 0.7, p.mut = 0.3, survival.strategy = {"plus", "comma"}, n.elite = 0, custom.constants = list(), log.stats = list(fitness = list("min", "mean", "max")), log.pop = FALSE, monitor, initial.solution, parent.selector, survival.selector, mutator, recombinator, terminators = list(stopOnIters(100)))</dt><dd><p>
    performs whole optimization. Params:
</p>
<ul class="org-ul">
<li><code>fitness.fun</code> may contain <code>n.objectives</code>, <code>minimize</code>, <code>n.dim</code>, <code>lower</code>, <code>upper</code></li>
<li><code>mu</code>, <code>lambda</code>: generation settings</li>
<li><code>mutator</code>, <code>recombinator</code>, <code>survival.selector</code>, <code>parent.selector</code>: choose operators</li>
<li>Dimension dependent on <code>representation</code>:
<dl class="org-dl">
<dt>"binary"</dt><dd><code>n.bits</code></dd>
<dt>"float"</dt><dd><code>n.dim</code> [ <code>lower</code>, <code>upper</code> ]</dd>
<dt>"permutation"</dt><dd><code>perm</code></dd>
<dt>"custom"</dt><dd><code>initial.solution</code></dd>
</dl></li>
<li><code>survival.strategy</code> selects <a href="#org71e8716">replaceMuPlusLambda</a> / <a href="#org8ea0c06">replaceMuCommaLambda</a>
<ul class="org-ul">
<li><code>n.elite</code> for "comma"</li>
</ul></li>
<li><code>p.recomb</code>, <code>p.mut</code> for <a href="#org522935d">generateOffspring</a></li>
<li><code>custom.constants</code> is not used.</li>
<li><code>log.stats</code>, <code>log.pop</code> for logging; <code>monitor</code> probably as well, but not used.</li>
<li><code>parent.selector</code>, <code>survival.selector</code>, <code>mutator</code>, <code>recombinator</code>, <code>terminators</code>: operators</li>
</ul>
<p>
Flow:
</p>
<ul class="org-ul">
<li><a href="#orgc2fdaf2">initECRControl</a>()</li>
<li><a href="#orgf8b1e5d">registerECROperator</a> \(\circ\) <a href="#orgb75fc3c">getDefaultEvolutionaryOperators</a></li>
<li><a href="#orgc5c7e03">initLogger</a>()</li>
<li><a href="#org57675e4">initPopulation</a>()
<ul class="org-ul">
<li>[using <a href="#org5139d65">generator operators</a>]</li>
</ul></li>
<li>Loop:
<ul class="org-ul">
<li><a href="#org522935d">generateOffspring</a>
<ul class="org-ul">
<li>[calls <a href="#org889d376">recombinate</a> (or skips this, but getMatingPool still gets called)]
<ul class="org-ul">
<li>[calls getMatingPool]
<ul class="org-ul">
<li>[calls <a href="#org1c7a918">selectForMating</a>]
<ul class="org-ul">
<li>[calls <b>$<a href="#org1c7a918">selectForMating</a></b> slot <a href="#org30d12c8">selection operators</a>]</li>
</ul></li>
</ul></li>
<li>[calls <b>$recombine</b> slot <a href="#org9144638">crossover operators</a>]</li>
</ul></li>
<li>[calls <a href="#orgf16518e">mutate</a>]
<ul class="org-ul">
<li>[calls <b>$<a href="#orgf16518e">mutate</a></b> slot <a href="#org6882ed1">mutation operators</a>]</li>
</ul></li>
</ul></li>
<li><a href="#org2c65bfc">evaluateFitness</a>
<ul class="org-ul">
<li>[evaluates the task's *$fitness.fun*]</li>
</ul></li>
<li><a href="#org71e8716">replaceMuPlusLambda</a> / <a href="#org8ea0c06">replaceMuCommaLambda</a>
<ul class="org-ul">
<li>[calls <a href="#orgdc3eae0">selectForSurvival</a>]
<ul class="org-ul">
<li>[calls <b>$<a href="#orgdc3eae0">selectForSurvival</a></b> slot <a href="#org30d12c8">selection operators</a>]</li>
</ul></li>
</ul></li>
</ul></li>
<li><a href="#orgd2f9e66">updateLogger</a></li>
</ul>
<p>
Returns <a id="org9b3b75b">ecr_result</a> (<a id="orgdfce16e">ecr_multi_objective_result</a> or <a id="org58d08c8">ecr_single_objective_result</a>)
</p>
<ul class="org-ul">
<li>$task</li>
<li>$best.x <b>single objective</b></li>
<li>$best.y <b>single objective</b></li>
<li>pareto.idx: index into last.population of pareto front <b>multi objective</b></li>
<li>pareto.front: matrix of objective values for pareto.set</li>
<li>pareto.set: just population[pareto.idx]</li>
<li>log: logger object</li>
<li>last.population</li>
<li>last.fitness <b>single objective</b></li>
<li>message</li>
</ul></dd>
<dt><a id="org851b0b2">nsga2</a>(fitness.fun, n.objectives, n.dim, minimize, lower, uppwer, mu = 100, lambda, mutator = <a href="#org9759fec">mutPolynomial</a>(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = <a href="#org0fbb153">recSBX</a>(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100)))</dt><dd>performs NSGA-II EMOA algorithm: calls <a href="#orgbd2c58d">ecr</a>() with representation = "float", survival.strategy = "plus", parent.selector = <a href="#org1175f57">selSimple</a>, survival.selector = <a href="#orgfe09887">selNondom</a></dd>
<dt><a id="org442de53">smsemoa</a>(fitness.fun, n.objectives, n.dim, minimize, lower, upper, mu = 100, ref.point [numeric, defaults to rep(11, n.objectives), wtf!], mutator = <a href="#org9759fec">mutPolynomial</a>(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = <a href="#org0fbb153">recSBX</a>(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100)))</dt><dd>performs SMS-EMOA algorithm: calls <a href="#orgbd2c58d">ecr</a>() with lambda = 1, representation = "float", survival.strategy = "plus", parent.selector = <a href="#org1175f57">selSimple</a>, survival.selector = <a href="#org926cac4">selDomHV</a>(ref.point)</dd>
<dt><a id="org67d3da3">asemoa</a>(fitness.fun, n.objectives, minimize, n.dim, lower, upper, mu = 10, aspiration.set, normalize.fun, dist.fun [function(x), default euclidean], p = 1, parent.selector = <a href="#org1175f57">selSimple</a>, mutator = <a href="#org9759fec">mutPolynomial</a>(eta = 25, p = 0.2, lower = lower, upper = upper), recombinator = <a href="#org0fbb153">recSBX</a>(eta = 15, p = 0.7, lower = lower, upper = upper), terminators = list(stopOnIters(100)))</dt><dd><p>
    "Aspiration set evolutionary multi-objective algorithm"
</p>
<ul class="org-ul">
<li><code>aspiration.set</code> is a matrix of aspiration points</li>
<li><code>normalize.fun</code> a function(set, aspiration.set) -&gt;</li>
<li>defines <b><b>fastASEMOASelector</b></b>:</li>
</ul>
<p>
calls <a href="#orgbd2c58d">ecr</a>() with representation = "float", lambda = 1, initial.solution a set of nondominated uniformly sampled individuals, and survival.selector the "fastASEMOASelector".
</p></dd>
</dl>
</div>
</div>
