ecrdoc.org
** Init functions
  - <<<initECRControl>>>(fitness.fun [function], n.objectives [int(1)], minimize [lgl, default TRUE]) ::
    inits *<<<ecr_control>>>* object.
    - $task: ecr_optimization_task
    - $[slot]: function, added by registerECROperator. Special slots:
      - mutate :: [[mutation operators][mutation operators]]
      - recombine :: [[crossover operators][crossover operators]]
      - selectForSurvival :: [[selection operators][selection operators]]
      - selectForMating :: [[selection operators][selection operators]]
    - $[slot].pars: list, added by registerECROperator
  - <<<makeOptimizationTask>>>(fun [function], n.objectives [int(1)], minimize [lgl, default TRUE], objective.names [chr]) ::
    inits **<<<ecr_optimization_task>>>**.
    - $fitness.fun: must return a vector of =n.objectives= length
    - $n.objectives
    - $minimize
    - $objective.names
    - $par.set [initialized from =fun= if it has one, otherwise 'CharacterParam']
  - <<<registerECROperator>>>(control [ecr_control], slot [chr(1)], fun , ...) ::
    adds [slot] and [slot].pars to `control`.
  - <<<initLogger>>>(control, log.stats [named list], log.extras, log.pop [logical(1)], init.size = 1000) ::
    creates <<<ecr_logger>>> [[logger][logger]] which mainly contains:
    - $env :: an environment with a data.frame $stats which gets the type  <<<ecr_statistics>>>
      - =best.x=, =best.y= *single objective*
    - $log.stats :: named list of functions to apply. name can be "fitness" or something names an attribute of individuals
  - <<<initPopulation>>>(mu [integer(1)], gen.fun [[[generator operators][[generator operators]]], initial.solutions = NULL) :: 
    fill up to =mu= with =initial.solutions= and then =gen.fun=.
  - <<<initParetoArchive>>>(control, max.size = Inf, trunc.fun = NULL [function(archive, inds, fitness, ...)]) :: 
    A [[Pareto Archive][Pareto Archive]] is a collection of pareto fronts of class <<<ecr_pareto_archive>>> with one member $env which has members:
    - $task
    - $size
    - $max.size
    - $trunc.fun: function(archive, inds, fitness) -> named list(individuals, fitness)
    - $minimize
    - $fitness [matrix]
    - $individuals [list]
** Individual Action
 These have all a =control= [ecr_control] ecr and (exept replaceMuPlusLambda / *CommaLambda) an =inds= [list] parameter.
  - <<<evaluateFitness>>>(...) :: 
    =lapply= control's $fitness.fun, return **<<<ecr_fitness_matrix>>>** of the result. This is a matrix with an additional
    "minimize" tag (from the ecr_optimization_task)
  - <<<generateOffspring>>>(fitness, lambda, p.recomb = 0.7, p.mut = 0.1) ::
    Subsumes both:
    - <<<mutate>>>(p.mut = 0.1, slot = "mutate", ...) ::
      applies the =slot= function in =control= to individuals w/ probability =p.mut=.
    - <<<recombinate>>>(fitness, lambda = length(inds), p.recomb = 0.7, slot = "recombine", ...) ::
      uses selectForMating(=fitness=), generates =lambda= children from them by recombinating w/ prob =p.recomb=
  - <<<replaceMuPlusLambda>>>, <<<replaceMuCommaLambda>>> (population, offspring, fitness, fitness.offspring, n.elite) ::
    selects =lengt(population)= individuals from the combined pool.
    - fitness, fitness.offspring: [matrix] that are optional if elements in population/offspring lists have attribute "fitness"
    - n.elite (default =ceiling(length(population) * 0.1)=): number of elite in replaceMuCommaLambda to keep.
  - <<<selectForSurvival>>>(fitness, n.select), <<<selectForMating>>>(fitness, n.select) ::
    call the ecr_selector function of the control slot with the appropriate name
* Operators
 - <<<makeOperator>>>(operator [function], supported {"permutation", "float", "binary", "custom"}) ::
   creates <<<ecr_operator>>> object which is a function with =supported= attribute
 - <<<isEcrOperator>>>(obj) :: check whether an object is an ecr_operator.
 - <<<getSupportedRepresentations>>>(operator) :: returns =supported= archive of ecr_operator
 - <<<is.supported(operator, representation [character(1)]) :: get whether =representation= is supported by =operator=.
 - <<<setup>>>(operator, ...) :: currying: turns setup(operator, a, b) turns =opperator(x, a, b)= into =operator'(x)=
** mutation operators
  - <<<makeMutator>>>(mutator, supported) ::
    <<<ecr_mutator>>>: subclass of ecr_operator
 These all have parameter 'ind': individuum / vector to mutate. evaluateFitness
  - <<<mutBitflip>>>(p = 0.1) :: mutate binary w/ probability =p=
  - <<<mutGauss>>>(p = 1, sdev = .05, lower, upper) :: mutate each w/ probability p:
    add rnorm(sd = sdev), truncate at lower / upper
  - <<<mutInsertion>>>() :: moves random component to a different position without swapping
  - <<<mutInversion>>>() :: reverse region between random indices
  - <<<mutPolynomial>>>(p = 0.2, eta = 10, lower, upper) :: mutate each w/ probability p:
    add //something random polynomial//
  - <<<mutScramble>>>() :: shuffles region between random indices
  - <<<mutSwap>>>() :: swaps random two components
  - <<<mutUniform>>>(lower, upper) :: replaces random element with uniformly distributed value
** selection operators
  - <<<makeSelector>>>(selector, supported, supported.objectives {"single-objective", "multi-objective"}, supported.opt.direction {"minimize", "maximize", or c() of both}) ::
    <<<ecr_selector>>>, an ecr_operator with additional attributes =supported.objectives=, =supported.opt.direction=
 These all have parameter 'fitness': [dim] x [n indiv] matrix, n.select: number of inds to select.
  - <<<selDomHV>>>(ref.point) :: drops individual from last paretofront with minimal hypervolume contribution. This ignores n.select! **minimizes**
  - <<<selGreedy>>>() :: select best n.select individuals. **minimizes**, **1-dim**
  - <<<selNondom>>>() :: nondominated sorting + crowding distance to select subset of individuals. used in NSGA-II EMOA **minimizes**
  - <<<selRoulette>>>(offset = 0.1) :: fitness-proportional selection, with minimum set to `offset`. **maximizes**, **1-dim**
  - <<<selSimple>>>() :: random sampling
  - <<<selTournament>>>(k) :: select best individuals from random subsets of size `k`. **minimizes**, **1-dim**
