ecrdoc.html

<div id="outline-container-org3e9fba9" class="outline-3">
<h3 id="org3e9fba9"><span class="section-number-3">1.2</span> Init functions</h3>
<div class="outline-text-3" id="text-1-2">
<dl class="org-dl">
<dt><a id="orgc2fdaf2">initECRControl</a>(fitness.fun [function], n.objectives [int(1)], minimize [lgl, default TRUE])</dt><dd>inits <b><a id="org5d9b4ea">ecr_control</a></b> object.
<ul class="org-ul">
<li>$task: <a href="#org9d5ba49">ecr_optimization_task</a></li>
<li>$[slot]: function, added by <a href="#orgf8b1e5d">registerECROperator</a>. Special slots:
<dl class="org-dl">
<dt><a href="#orgf16518e">mutate</a></dt><dd><a href="#org6882ed1">mutation operators</a></dd>
<dt>recombine</dt><dd><a href="#org9144638">crossover operators</a></dd>
<dt><a href="#orgdc3eae0">selectForSurvival</a></dt><dd><a href="#org30d12c8">selection operators</a></dd>
<dt><a href="#org1c7a918">selectForMating</a></dt><dd><a href="#org30d12c8">selection operators</a></dd>
</dl></li>
<li>$[slot].pars: list, added by <a href="#orgf8b1e5d">registerECROperator</a></li>
</ul></dd>
<dt><a id="org9df51fe">makeOptimizationTask</a>(fun [function], n.objectives [int(1)], minimize [lgl, default TRUE], objective.names [chr])</dt><dd>inits <b><b><a id="org9d5ba49">ecr_optimization_task</a></b></b>.
<ul class="org-ul">
<li>$fitness.fun: must return a vector of <code>n.objectives</code> length</li>
<li>$n.objectives</li>
<li>$minimize</li>
<li>$objective.names</li>
<li>$par.set [initialized from <code>fun</code> if it has one, otherwise 'CharacterParam']</li>
</ul></dd>
<dt><a id="orgf8b1e5d">registerECROperator</a>(control [<a href="#org5d9b4ea">ecr_control</a>], slot [chr(1)], fun , &#x2026;)</dt><dd>adds [slot] and [slot].pars to `control`.</dd>
<dt><a id="orgc5c7e03">initLogger</a>(control, log.stats [named list], log.extras, log.pop [logical(1)], init.size = 1000)</dt><dd>creates <a id="org2c012de">ecr_logger</a> <a href="#org111cb4b">logger</a> which mainly contains:
<dl class="org-dl">
<dt>$env</dt><dd>an environment with a data.frame $stats which gets the type  <a id="orga8e3b1f">ecr_statistics</a>
<ul class="org-ul">
<li><code>best.x</code>, <code>best.y</code> <b>single objective</b></li>
</ul></dd>
<dt>$log.stats</dt><dd>named list of functions to apply. name can be "fitness" or something names an attribute of individuals</dd>
</dl></dd>
<dt><a id="org57675e4">initPopulation</a>(mu [integer(1)], gen.fun [[[generator operators]<a href="#org5139d65">2.3</a>], initial.solutions = NULL)</dt><dd>fill up to <code>mu</code> with <code>initial.solutions</code> and then <code>gen.fun</code>.</dd>
<dt><a id="org28a06c8">initParetoArchive</a>(control, max.size = Inf, trunc.fun = NULL [function(archive, inds, fitness, &#x2026;)])</dt><dd>A <a href="#org8927248">Pareto Archive</a> is a collection of pareto fronts of class <a id="orgbebd21c">ecr_pareto_archive</a> with one member $env which has members:
<ul class="org-ul">
<li>$task</li>
<li>$size</li>
<li>$max.size</li>
<li>$trunc.fun: function(archive, inds, fitness) -&gt; named list(individuals, fitness)</li>
<li>$minimize</li>
<li>$fitness [matrix]</li>
<li>$individuals [list]</li>
</ul></dd>
</dl>
</div>
</div>
<div id="outline-container-org8f9f7c2" class="outline-3">
<h3 id="org8f9f7c2"><span class="section-number-3">1.3</span> Individual Action</h3>
<div class="outline-text-3" id="text-1-3">
<p>
These have all a <code>control</code> [<a href="#org5d9b4ea">ecr_control</a>] <a href="#orgbd2c58d">ecr</a> and (exept <a href="#org71e8716">replaceMuPlusLambda</a> / *CommaLambda) an <code>inds</code> [list] parameter.
</p>
<dl class="org-dl">
<dt><a id="org2c65bfc">evaluateFitness</a>(&#x2026;)</dt><dd><code>lapply</code> control's $fitness.fun, return <b><b><a id="orga7f2837">ecr_fitness_matrix</a></b></b> of the result. This is a matrix with an additional
"minimize" tag (from the <a href="#org9d5ba49">ecr_optimization_task</a>)</dd>
<dt><a id="org522935d">generateOffspring</a>(fitness, lambda, p.recomb = 0.7, p.mut = 0.1)</dt><dd>Subsumes both:
<dl class="org-dl">
<dt><a id="orgf16518e">mutate</a>(p.mut = 0.1, slot = "<a href="#orgf16518e">mutate</a>", &#x2026;)</dt><dd>applies the <code>slot</code> function in <code>control</code> to individuals w/ probability <code>p.mut</code>.</dd>
<dt><a id="org889d376">recombinate</a>(fitness, lambda = length(inds), p.recomb = 0.7, slot = "recombine", &#x2026;)</dt><dd>uses <a href="#org1c7a918">selectForMating</a>(<code>fitness</code>), generates <code>lambda</code> children from them by recombinating w/ prob <code>p.recomb</code></dd>
</dl></dd>
<dt><a id="org71e8716">replaceMuPlusLambda</a>, <a id="org8ea0c06">replaceMuCommaLambda</a> (population, offspring, fitness, fitness.offspring, n.elite)</dt><dd>selects <code>lengt(population)</code> individuals from the combined pool.
<ul class="org-ul">
<li>fitness, fitness.offspring: [matrix] that are optional if elements in population/offspring lists have attribute "fitness"</li>
<li>n.elite (default <code>ceiling(length(population) * 0.1)</code>): number of elite in <a href="#org8ea0c06">replaceMuCommaLambda</a> to keep.</li>
</ul></dd>
<dt><a id="orgdc3eae0">selectForSurvival</a>(fitness, n.select), <a id="org1c7a918">selectForMating</a>(fitness, n.select)</dt><dd>call the <a href="#orgab465e8">ecr_selector</a> function of the control slot with the appropriate name</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-org26da823" class="outline-2">
<h2 id="org26da823"><span class="section-number-2">2</span> Operators</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt><a id="orged38ccd">makeOperator</a>(operator [function], supported {"permutation", "float", "binary", "custom"})</dt><dd>creates <a id="org1cf6c3d">ecr_operator</a> object which is a function with <code>supported</code> attribute</dd>
<dt><a id="orgd651099">isEcrOperator</a>(obj)</dt><dd>check whether an object is an <a href="#org1cf6c3d">ecr_operator</a>.</dd>
<dt><a id="orgfd39a6d">getSupportedRepresentations</a>(operator)</dt><dd>returns <code>supported</code> archive of <a href="#org1cf6c3d">ecr_operator</a></dd>
<dt>&lt;&lt;&lt;is.supported(operator, representation [character(1)])</dt><dd>get whether <code>representation</code> is supported by <code>operator</code>.</dd>
<dt><a id="org16b1eef">setup</a>(operator, &#x2026;)</dt><dd>currying: turns <a href="#org16b1eef">setup</a>(operator, a, b) turns <code>opperator(x, a, b)</code> into <code>operator'(x)</code></dd>
</dl>
</div>
<div id="outline-container-org6882ed1" class="outline-3">
<h3 id="org6882ed1"><span class="section-number-3">2.1</span> mutation operators</h3>
<div class="outline-text-3" id="text-2-1">
<dl class="org-dl">
<dt><a id="org3e8e71e">makeMutator</a>(mutator, supported)</dt><dd><a id="orgba630aa">ecr_mutator</a>: subclass of <a href="#org1cf6c3d">ecr_operator</a></dd>
</dl>
<p>
These all have parameter 'ind': individuum / vector to <a href="#orgf16518e">mutate</a>. <a href="#org2c65bfc">evaluateFitness</a>
</p>
<dl class="org-dl">
<dt><a id="orgcf359e3">mutBitflip</a>(p = 0.1)</dt><dd><a href="#orgf16518e">mutate</a> binary w/ probability <code>p</code></dd>
<dt><a id="orgfb961b9">mutGauss</a>(p = 1, sdev = .05, lower, upper)</dt><dd><a href="#orgf16518e">mutate</a> each w/ probability p:
add rnorm(sd = sdev), truncate at lower / upper</dd>
<dt><a id="orgd2c9b21">mutInsertion</a>()</dt><dd>moves random component to a different position without swapping</dd>
<dt><a id="org37a2d08">mutInversion</a>()</dt><dd>reverse region between random indices</dd>
<dt><a id="org9759fec">mutPolynomial</a>(p = 0.2, eta = 10, lower, upper)</dt><dd><a href="#orgf16518e">mutate</a> each w/ probability p:
add <i><i>something random polynomial</i></i></dd>
<dt><a id="org3b12fbf">mutScramble</a>()</dt><dd>shuffles region between random indices</dd>
<dt><a id="org3f88d27">mutSwap</a>()</dt><dd>swaps random two components</dd>
<dt><a id="orgea90490">mutUniform</a>(lower, upper)</dt><dd>replaces random element with uniformly distributed value</dd>
</dl>
</div>
</div>
<div id="outline-container-org30d12c8" class="outline-3">
<h3 id="org30d12c8"><span class="section-number-3">2.2</span> selection operators</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt><a id="org1c9960c">makeSelector</a>(selector, supported, supported.objectives {"single-objective", "multi-objective"}, supported.opt.direction {"minimize", "maximize", or c() of both})</dt><dd><a id="orgab465e8">ecr_selector</a>, an <a href="#org1cf6c3d">ecr_operator</a> with additional attributes <code>supported.objectives</code>, <code>supported.opt.direction</code></dd>
</dl>
<p>
These all have parameter 'fitness': [dim] x [n indiv] matrix, n.select: number of inds to select.
</p>
<dl class="org-dl">
<dt><a id="org926cac4">selDomHV</a>(ref.point)</dt><dd>drops individual from last paretofront with minimal hypervolume contribution. This ignores n.select! <b><b>minimizes</b></b></dd>
<dt><a id="orge406518">selGreedy</a>()</dt><dd>select best n.select individuals. <b><b>minimizes</b></b>, <b><b>1-dim</b></b></dd>
<dt><a id="orgfe09887">selNondom</a>()</dt><dd>nondominated sorting + crowding distance to select subset of individuals. used in NSGA-II EMOA <b><b>minimizes</b></b></dd>
<dt><a id="org5f958d2">selRoulette</a>(offset = 0.1)</dt><dd>fitness-proportional selection, with minimum set to `offset`. <b><b>maximizes</b></b>, <b><b>1-dim</b></b></dd>
<dt><a id="org1175f57">selSimple</a>()</dt><dd>random sampling</dd>
<dt><a id="org4148a83">selTournament</a>(k)</dt><dd>select best individuals from random subsets of size `k`. <b><b>minimizes</b></b>, <b><b>1-dim</b></b></dd>
</dl>
</div>
</div>
