ecrdoc.org
** generator operators
 Except =gen=, these have parameters (n, n.dim).
  - gen(expr, n) :: generate individuals by expression (this is =replicate(simplify = FALSE)=);
  - <<<genBin>>>() :: initialize random binary vector individuals
  - <<<genPerm>>>() :: initialize random permutation of 1:n individuals
  - <<<genReal>>>(lower, upper) :: uniform random reals between lower and upper
** crossover operators
  - makeRecombinator(recombinator, supported, n.parents [probably does not work with values != 1 or 2], n.children = 1) ::
    <<<ecr_recombinator>>>, an ecr_operator with additional attributes =n.parents=, =n.children=
 These all have =inds=: list of exactly two vectors representing parents
  - <<<recCrossover>>>() :: chromosomal crossover at random point, returns two children
  - <<<recIntermediate>>>() :: component-wise mean of parents. can possibly have more than two parents.
  - <<<recOX>>>() :: for permutations. randomly selects two cut points, keeps subsquence cut1:cut2 of one parent, fills remaining points with sequence =cut2:(cut2 + LENGTH) MOD length= of the other parent and removes duplicates.
  - <<<recPMX>>>() :: for permutations. randomly selects two cut points, keeps subsequence cut1:cut2 of one parent, fills remaining points with other parent's values, except where this would produce duplicates. The would-be duplicates are instead filled with the values at the corresponding positions from the second parent (recursively, if this still gives duplicates).
  - <<<recSBX>>>(eta = 5, p = 1, lower, upper) :: "simulated binary crossover", whatever that means. For continuous vectors.
  - <<<recUnifCrossover>>>(p = 0.5) :: swap components with componentwise probability =p=
** terminator operators
 Have class <<<ecr_terminator>>>: function with argument 'log' and attributes =name= and =message=. 
  - makeTerminator(condition.fun, name, message) :: general creator
  - stopOnIters(max.iters) :: name "IterLimit"
  - stopOnEvlas(max.evals) :: name "FunctionEvaluationsLimit"
** EMOA
 Have class <<<ecr_emoa_indicator>>>: function with argument 'points', 'ref.points', and attribute =lates_name=
  - emoaIndEps() :: ???
  - emoaIndHV(ref.point) :: ???
  - emoaIndR{1,2,3}(ideal.point, nadir.point, lambda, utility {"weightedsum", "tschebycheff", "augmented tschbycheff" (sic)}) :: ???
* helper functions
 - <<<doNondominatedSorting>>>(x [matrix]) ::
   sort into nondominated fronts.
   - x "dominates" y if it is *smaller* in all dimensions.
   - x: each **column** contains one point
   - return list(ranks, dom.counter)
 - <<<approximateNadirPoint>>>(..., sets = NULL), <<<approximateIdealPoint>>>(..., sets = NULL) ::
   for each set (given in ... or sets), calculate dimensionwise max (Nadir) or min (Ideal) point.
 - <<<wrapChildren>>>(...) :: turns returns =list(...)= tagged with "multiple"
 - <<<getDefaultEvolutionaryOperators>>>(representation, type, n.objectives, control) ::
   - =control= :: not used
   - =n.objectives= :: only used to choose between getSingleObjectiveDefaults() and getMultiObjectiveDefaults().
   - =representation= :: "float", "binary", "permutation", "custom"
   - =type= :: what function to get
     - "mutator" :: mutGauss, mutBitflip, or mutSwap
     - "recombinator" :: recIntermediate, recCrossover, recPMX
     - "survival.selector" :: selGreedy in single-o, selNondom in multi-o
     - "parent.selector" :: selTournament in single-o, selSimple in multi-o
** Computation	  
  - <<<computeHV>>>(x, ref.point = NULL), <<<computeHVContr>>>(x, ref.point = NULL, offset = 1) ::
    dominated hypervolume w.r.t. reference point.
    - if ref.point is NULL, the dimension-wise maximum is used
    - 'offset' is added to the computed ref.point if it is given as NULL for *Contr
  - <<<computeCrowdingDistance>>>(x [matrix) ::
    compute "crowding distance": dimension-wise sum of distance to both neighbouring points (in that dimension)
  - <<<computeGenerationalDistance>>>, <<<computeInvertedGenerationalDistance>>>(A [matrix], B [matrix], p = 1, normalize = FALSE, dist.fun = [function(x), default euclidean distance, is ignored]) ::
    Compute "generational distance" betwen =A= and =B=. computeInverted* does the same as computeGenerational*, with =A= and =B= swapped.
    - if =normalize= is TRUE, =A= is scaled to have same dimension-wise mins / maxes as =B=
    - for each in =A=, calculate minimal distance to any in =B=
    - calculate exponent-=p= mean of the vector of these minimal distances.
  - <<<computeDistanceFromPointToSetOfPoints>>>(a, B, dist.fun [function(x), euclidean by default]) ::
    calculates minimum distance from =a= to any point in =B=
  - <<<computeAverageHausdorffDistance>>>(A, B, p = 1, normalize, dist.fun [function(x), euclidean by default]) ::
    max of computeGenerationalDistance and computeInvertedGenerationalDistance (i.e. generational distance with both matrices swapped)
** domination
  - dominated(x), nondominated(x), which.dominated(x), which.nondominated(x)
  - isMaximallyDominated(x)
  - dominates(x, y), isDominated(y, x), %dominates%, %isDominatedBy%
  - setDominates(x, y): whether all y are dominated by at least one x
** logger
 See also initLogger.
  - <<<updateLogger>>>(log, population [list], fitness [matrix], n.evals [integer(1)], extras) ::
    - updates log
  - <<<toGG>>>(x, strop.stats [character]) :: convert logger to ggplot2-friendly data.frame
  - <<<getStatistics>>>(log, trim = TRUE) :: get $stats slot of log's $env, trims unused rows by default.
  - <<<getPopulations>>>(log, trim = TRUE) :: get the $pop slot of the log's $env, trim unused rows by default.
  - <<<getParetoFront>>>(x) :: get the fitness values. can also be applied to ecr_multi_objective_result.
