ecrdoc.html
<div id="outline-container-org5139d65" class="outline-3">
<h3 id="org5139d65"><span class="section-number-3">2.3</span> generator operators</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Except <code>gen</code>, these have parameters (n, n.dim).
</p>
<dl class="org-dl">
<dt>gen(expr, n)</dt><dd>generate individuals by expression (this is <code>replicate(simplify = FALSE)</code>);</dd>
<dt><a id="org697d2c9">genBin</a>()</dt><dd>initialize random binary vector individuals</dd>
<dt><a id="org4ccead8">genPerm</a>()</dt><dd>initialize random permutation of 1:n individuals</dd>
<dt><a id="org179fd65">genReal</a>(lower, upper)</dt><dd>uniform random reals between lower and upper</dd>
</dl>
</div>
</div>
<div id="outline-container-org9144638" class="outline-3">
<h3 id="org9144638"><span class="section-number-3">2.4</span> crossover operators</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt>makeRecombinator(recombinator, supported, n.parents [probably does not work with values != 1 or 2], n.children = 1)</dt><dd><a id="orgb183058">ecr_recombinator</a>, an <a href="#org1cf6c3d">ecr_operator</a> with additional attributes <code>n.parents</code>, <code>n.children</code></dd>
</dl>
<p>
These all have <code>inds</code>: list of exactly two vectors representing parents
</p>
<dl class="org-dl">
<dt><a id="org10eb148">recCrossover</a>()</dt><dd>chromosomal crossover at random point, returns two children</dd>
<dt><a id="org5ed8dd0">recIntermediate</a>()</dt><dd>component-wise mean of parents. can possibly have more than two parents.</dd>
<dt><a id="org2a8711a">recOX</a>()</dt><dd>for permutations. randomly selects two cut points, keeps subsquence cut1:cut2 of one parent, fills remaining points with sequence <code>cut2:(cut2 + LENGTH) MOD length</code> of the other parent and removes duplicates.</dd>
<dt><a id="orgb5f31d6">recPMX</a>()</dt><dd>for permutations. randomly selects two cut points, keeps subsequence cut1:cut2 of one parent, fills remaining points with other parent's values, except where this would produce duplicates. The would-be duplicates are instead filled with the values at the corresponding positions from the second parent (recursively, if this still gives duplicates).</dd>
<dt><a id="org0fbb153">recSBX</a>(eta = 5, p = 1, lower, upper)</dt><dd>"simulated binary crossover", whatever that means. For continuous vectors.</dd>
<dt><a id="orgbc5aeef">recUnifCrossover</a>(p = 0.5)</dt><dd>swap components with componentwise probability <code>p</code></dd>
</dl>
</div>
</div>
<div id="outline-container-org22500bd" class="outline-3">
<h3 id="org22500bd"><span class="section-number-3">2.5</span> terminator operators</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Have class <a id="orged96179">ecr_terminator</a>: function with argument 'log' and attributes <code>name</code> and <code>message</code>. 
</p>
<dl class="org-dl">
<dt>makeTerminator(condition.fun, name, message)</dt><dd>general creator</dd>
<dt>stopOnIters(max.iters)</dt><dd>name "IterLimit"</dd>
<dt>stopOnEvlas(max.evals)</dt><dd>name "FunctionEvaluationsLimit"</dd>
</dl>
</div>
</div>
<div id="outline-container-orgbf46f2d" class="outline-3">
<h3 id="orgbf46f2d"><span class="section-number-3">2.6</span> EMOA</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Have class <a id="orgcaeb2d2">ecr_emoa_indicator</a>: function with argument 'points', 'ref.points', and attribute <code>lates_name</code>
</p>
<dl class="org-dl">
<dt>emoaIndEps()</dt><dd>???</dd>
<dt>emoaIndHV(ref.point)</dt><dd>???</dd>
<dt>emoaIndR{1,2,3}(ideal.point, nadir.point, lambda, utility {"weightedsum", "tschebycheff", "augmented tschbycheff" (sic)})</dt><dd>???</dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgdf58156" class="outline-2">
<h2 id="orgdf58156"><span class="section-number-2">3</span> helper functions</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt><a id="orgeadf107">doNondominatedSorting</a>(x [matrix])</dt><dd>sort into nondominated fronts.
<ul class="org-ul">
<li>x "dominates" y if it is <b>smaller</b> in all dimensions.</li>
<li>x: each <b><b>column</b></b> contains one point</li>
<li>return list(ranks, dom.counter)</li>
</ul></dd>
<dt><a id="org01bad0a">approximateNadirPoint</a>(&#x2026;, sets = NULL), <a id="org3972d54">approximateIdealPoint</a>(&#x2026;, sets = NULL)</dt><dd>for each set (given in &#x2026; or sets), calculate dimensionwise max (Nadir) or min (Ideal) point.</dd>
<dt><a id="org5749e51">wrapChildren</a>(&#x2026;)</dt><dd>turns returns <code>list(...)</code> tagged with "multiple"</dd>
<dt><a id="orgb75fc3c">getDefaultEvolutionaryOperators</a>(representation, type, n.objectives, control)</dt><dd><dl class="org-dl">
<dt><code>control</code></dt><dd>not used</dd>
<dt><code>n.objectives</code></dt><dd>only used to choose between getSingleObjectiveDefaults() and getMultiObjectiveDefaults().</dd>
<dt><code>representation</code></dt><dd>"float", "binary", "permutation", "custom"</dd>
<dt><code>type</code></dt><dd>what function to get
<dl class="org-dl">
<dt>"mutator"</dt><dd><a href="#orgfb961b9">mutGauss</a>, <a href="#orgcf359e3">mutBitflip</a>, or <a href="#org3f88d27">mutSwap</a></dd>
<dt>"recombinator"</dt><dd><a href="#org5ed8dd0">recIntermediate</a>, <a href="#org10eb148">recCrossover</a>, <a href="#orgb5f31d6">recPMX</a></dd>
<dt>"survival.selector"</dt><dd><a href="#orge406518">selGreedy</a> in single-o, <a href="#orgfe09887">selNondom</a> in multi-o</dd>
<dt>"parent.selector"</dt><dd><a href="#org4148a83">selTournament</a> in single-o, <a href="#org1175f57">selSimple</a> in multi-o</dd>
</dl></dd>
</dl></dd>
</dl>
</div>
<div id="outline-container-org65b2b4e" class="outline-3">
<h3 id="org65b2b4e"><span class="section-number-3">3.1</span> Computation</h3>
<div class="outline-text-3" id="text-3-1">
<dl class="org-dl">
<dt><a id="org7253810">computeHV</a>(x, ref.point = NULL), <a id="org2d31a3f">computeHVContr</a>(x, ref.point = NULL, offset = 1)</dt><dd>dominated hypervolume w.r.t. reference point.
<ul class="org-ul">
<li>if ref.point is NULL, the dimension-wise maximum is used</li>
<li>'offset' is added to the computed ref.point if it is given as NULL for *Contr</li>
</ul></dd>
<dt><a id="org911dee6">computeCrowdingDistance</a>(x [matrix)</dt><dd>compute "crowding distance": dimension-wise sum of distance to both neighbouring points (in that dimension)</dd>
<dt><a id="org4e1083e">computeGenerationalDistance</a>, <a id="orgbe49a56">computeInvertedGenerationalDistance</a>(A [matrix], B [matrix], p = 1, normalize = FALSE, dist.fun = [function(x), default euclidean distance, is ignored])</dt><dd>Compute "generational distance" betwen <code>A</code> and <code>B</code>. computeInverted* does the same as computeGenerational*, with <code>A</code> and <code>B</code> swapped.
<ul class="org-ul">
<li>if <code>normalize</code> is TRUE, <code>A</code> is scaled to have same dimension-wise mins / maxes as <code>B</code></li>
<li>for each in <code>A</code>, calculate minimal distance to any in <code>B</code></li>
<li>calculate exponent-<code>p</code> mean of the vector of these minimal distances.</li>
</ul></dd>
<dt><a id="orgd0e2eb8">computeDistanceFromPointToSetOfPoints</a>(a, B, dist.fun [function(x), euclidean by default])</dt><dd>calculates minimum distance from <code>a</code> to any point in <code>B</code></dd>
<dt><a id="orga4c0254">computeAverageHausdorffDistance</a>(A, B, p = 1, normalize, dist.fun [function(x), euclidean by default])</dt><dd>max of <a href="#org4e1083e">computeGenerationalDistance</a> and <a href="#orgbe49a56">computeInvertedGenerationalDistance</a> (i.e. generational distance with both matrices swapped)</dd>
</dl>
</div>
</div>
<div id="outline-container-org97c751e" class="outline-3">
<h3 id="org97c751e"><span class="section-number-3">3.2</span> domination</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>dominated(x), nondominated(x), which.dominated(x), which.nondominated(x)</li>
<li>isMaximallyDominated(x)</li>
<li>dominates(x, y), isDominated(y, x), %dominates%, %isDominatedBy%</li>
<li>setDominates(x, y): whether all y are dominated by at least one x</li>
</ul>
</div>
</div>
<div id="outline-container-org111cb4b" class="outline-3">
<h3 id="org111cb4b"><span class="section-number-3">3.3</span> logger</h3>
<div class="outline-text-3" id="text-3-3">
<p>
See also <a href="#orgc5c7e03">initLogger</a>.
</p>
<dl class="org-dl">
<dt><a id="orgd2f9e66">updateLogger</a>(log, population [list], fitness [matrix], n.evals [integer(1)], extras)</dt><dd><ul class="org-ul">
<li>updates log</li>
</ul></dd>
<dt><a id="org2fa8be5">toGG</a>(x, strop.stats [character])</dt><dd>convert logger to ggplot2-friendly data.frame</dd>
<dt><a id="org8662bd8">getStatistics</a>(log, trim = TRUE)</dt><dd>get $stats slot of log's $env, trims unused rows by default.</dd>
<dt><a id="orgb5d2c5e">getPopulations</a>(log, trim = TRUE)</dt><dd>get the $pop slot of the log's $env, trim unused rows by default.</dd>
<dt><a id="org7bce3ab">getParetoFront</a>(x)</dt><dd>get the fitness values. can also be applied to <a href="#orgdfce16e">ecr_multi_objective_result</a>.</dd>
</dl>
</div>
</div>
