ecrdoc.org
** Pareto Archive
 See also initParetoArchive.
  - <<<updateParetoArchive>>>(archive, inds [list], fitness [matrix], ...) ::
    - adds points to =archive= and then reduces them to the nondominated individuals.
    - Possibly calls archive$trunc.fun if size oferflows.
  - <<<getSize>>>(x) :: number of stored individuals in pareto archive.
  - <<<getIndividuals>>>(x) :: get the $individuals slot of the archive's $env slot
** Plotting
  - <<<plotFront>>>(x, obj.names [character], minimize> [logical]) :: plot scatterplot of a front
  - <<<plotStatistics>>>(x [ecr_statistics | ecr_logger], drop.stats [character]) :: plot from a [[logger][logger]]
* Orphaned
 - makeECRMonitor
 - setupECRDefaultMonitor
 - normalizeFront

- asemoa
