ecrdoc.html
<div id="outline-container-org8927248" class="outline-3">
<h3 id="org8927248"><span class="section-number-3">3.4</span> Pareto Archive</h3>
<div class="outline-text-3" id="text-3-4">
<p>
See also <a href="#org28a06c8">initParetoArchive</a>.
</p>
<dl class="org-dl">
<dt><a id="orga1a3918">updateParetoArchive</a>(archive, inds [list], fitness [matrix], &#x2026;)</dt><dd><ul class="org-ul">
<li>adds points to <code>archive</code> and then reduces them to the nondominated individuals.</li>
<li>Possibly calls archive$trunc.fun if size oferflows.</li>
</ul></dd>
<dt><a id="orgd26c12e">getSize</a>(x)</dt><dd>number of stored individuals in pareto archive.</dd>
<dt><a id="orgd8e797e">getIndividuals</a>(x)</dt><dd>get the $individuals slot of the archive's $env slot</dd>
</dl>
</div>
</div>
<div id="outline-container-orgd2bc62c" class="outline-3">
<h3 id="orgd2bc62c"><span class="section-number-3">3.5</span> Plotting</h3>
<div class="outline-text-3" id="text-3-5">
<dl class="org-dl">
<dt><a id="org2d72d36">plotFront</a>(x, obj.names [character], minimize&gt; [logical])</dt><dd>plot scatterplot of a front</dd>
<dt><a id="org4be879a">plotStatistics</a>(x [<a href="#orga8e3b1f">ecr_statistics</a> | <a href="#org2c012de">ecr_logger</a>], drop.stats [character])</dt><dd>plot from a <a href="#org111cb4b">logger</a></dd>
</dl>
</div>
</div>
</div>
<div id="outline-container-orgd048e25" class="outline-2">
<h2 id="orgd048e25"><span class="section-number-2">4</span> Orphaned</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>makeECRMonitor</li>
<li>setupECRDefaultMonitor</li>
<li>normalizeFront</li>
</ul>
<ul class="org-ul">
<li><a href="#org67d3da3">asemoa</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: user</p>
<p class="date">Created: 2019-01-16 Wed 16:27</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
